#include "LEDji.h" 
#include "stm32f10x.h"

/*******************************************************************************
================================================================================
【平    台】stm32f103zet6_sumjess平台
【编    写】sumjess
【E-mail  】1371129880@qq.com
【软件版本】V2.0
【最后更新】2018年01月21日
【相关信息参考下列地址】
【网    站】http://www.openedv.com/
           http://www.stmcu.org/
					 http://www.firebbs.cn/forum.php
---------------------------------------------------------------------------------
【dev.env.】MDK5.14及以上版本
【Target  】stm32f103zet6
第一次修订：2017/11/09
第二次修订：2018/01/21
---------------------------------------------------------------------------------
没有完美的代码，只有不断的奉献，大家一起努力；
赠人玫瑰手留余香，欢迎大家反馈bug！
================================================================================
********************************************************************************/	
//LED驱动 代码	     


void LEDji_Init(void){
	
	RCC->APB2ENR|=1<<2;   //开启GPIOA的使能端
/***********************************************************
=赋值运算符  将右边的运算结果赋值给左边的变量
<<左移运算符   左移一位，相当于扩大2倍
|位或运算符    按二进制存储数据的位进行或运算，有1则1，全0为0
APB2ENR|=1     APB2ENR=APB2ENR|1
<<3            设置第二位为1
所以结果为：a= 8
**********************************************************/
	RCC->APB2ENR|=1<<5;   //开启GPIOD的使能端
	
	//GPIOA.8
	GPIOA->CRH&=0xFFFFFFF0;   //对应位寄存器清0
														//该位只要有一个值为0结果为0，否则结果为1
	GPIOA->CRH|=0x00000003;	
														//以上两步为初始化
	GPIOA->ODR|=1<<8;         //ODR是引脚电平输出的寄存器
	
	
	//GPIOD.2
	GPIOD->CRL&=0xFFFFF0FF;
	GPIOD->CRL|=0x00000300;	
	GPIOD->ODR|=1<<2;	
	
	
}


