#ifndef __SUMJESS_STEPPER_MOTOR_H
#define __SUMJESS_STEPPER_MOTOR_H

/*******************************************************************************
================================================================================
【平    台】stm32f103zet6_sumjess平台
【编    写】sumjess
【E-mail  】1371129880@qq.com
【软件版本】V2.0
【最后更新】2018年01月21日
【相关信息参考下列地址】
【网    站】http://www.openedv.com/
           http://www.stmcu.org/
					 http://www.firebbs.cn/forum.php
---------------------------------------------------------------------------------
【dev.env.】MDK5.14及以上版本
【Target  】stm32f103zet6
第一次修订：2017/11/09
第二次修订：2018/01/21
---------------------------------------------------------------------------------
没有完美的代码，只有不断的奉献，大家一起努力；
赠人玫瑰手留余香，欢迎大家反馈bug！
================================================================================
********************************************************************************/	
//步进电机 驱动例程

/*********************
接线方式:
IN1 ---- PC0
IN2 ---- PC2
IN3 ---- PC3
IN4 ---- PC10
+   ---- +5V
-   ---- GND
*********************/

#include "sys.h"



void bujin_Init(void);

void bujin_Z_Init(void);//顺时针

void bujin_F_Init(void);//逆时针

void bujin_D_Init(void);






#endif


