#include "main.h"
#include "tim.h"

unsigned char music2[]={  
      5,10,10,5,5,9,9,16,8,8,8,9,10,5,5,16,     //想去远方的山川，想去海边看海鸥
      6,8,8,6,5,10,10,16,9,8,8,6,9,16,          //不管风雨有多少，有你就足够
      5,10,10,5,5,9,9,16,8,8,8,6,5,10,10,16,    //喜欢看你的嘴角，喜欢看你的眉梢
      6,11,11,6,5,10,10,16,9,8,8,6,8,16,        //白云挂在那蓝天，像你的微笑
      5,12,5,5,12,5,9,16,8,6,8,8,8,10,12,16,    //你笑起来真好看，像春天的花一样！
      8,6,8,8,8,13,12,10,9,8,6,8,8,10,9,16,    //把所有的烦恼，所有的忧愁，统统都吹散
      5,12,5,5,12,5,9,16,8,6,8,8,13,12,16,     //你笑起来真好看，像夏天的阳光
      8,8,8,13,12,10,9,8,6,8,8,9,8,16,         //整个世界全部的时光，美得像画卷。           
    };

//                      低7  1   2   3   4   5   6   7  中1 中2 中3 中4 中5 中6 中7  高1  不发音
//unsigned int MusicalNote[] = {247,262,294,330,349,392,440,494,523,587,659,698,784,880,988,1046,1000};
/*采用40MHZ频率，可以输出的方波最低频率
因此，方波最低频率就是 40M / 65535 ，也就是：

>>> 40 * 1000 * 1000 / 65535
610.3608758678569*/

unsigned int MusicalNote[] = {989,1048,1176,1320,1399,1570,1763,1978,2096,2353,2641,2798,3140,3525,3957};

float pitch_names_frequency[] = {
    //0--A0
	27.50/*A0*/,29.14/*A#0*/,30.87/*B0*/,
    //3--C1
	32.70/*C1*/,34.65/*C#1*/,36.71/*D1*/,38.89/*D#1*/,41.20/*E1*/,43.65/*F1*/,46.25/*F#1*/,49.00/*G1*/,51.91/*G#1*/,55.00/*A1*/,58.27/*A#1*/,61.74/*B1*/,
	//15--C2
    65.41/*C2*/,69.30/*C#2*/,73.42/*D2*/,77.78/*D#2*/,82.41/*E2*/,87.31/*F2*/,92.5/*F#2*/,98.00/*G2*/,103.8/*G#2*/,110.0/*A2*/,116.5/*A#2*/,123.5/*B2*/,
	//27--C3
    130.8/*C3*/,138.6/*C#3*/,146.8/*D3*/,155.6/*D#3*/,164.8/*E3*/,174.6/*F3*/,185.0/*F#3*/,196.0/*G3*/,207.6/*G#3*/,220.0/*A3*/,233.1/*A#3*/,246.9/*B3*/,
	//39--C4
    261.6/*C4*/,277.2/*C#4*/,293.7/*D4*/,311.1/*D#4*/,329.6/*E4*/,349.2/*F4*/,370.0/*F#4*/,392.0/*G4*/,415.3/*G#4*/,440.0/*A4*/,466.2/*A#4*/,493.9/*B4*/,
	//51--C5
    523.2/*C5*/,554.4/*C#5*/,587.3/*D5*/,    622.2/*D#5*/,659.3/*E5*/,698.5/*F5*/,740.0/*F#5*/,784.0/*G5*/,830.6/*G#5*/,880.0/*A5*/,932.3/*A#5*/,987.8/*B5*/,
	//63--C6
    1046/*C6*/,1109/*C#6*/,1175/*D6*/,1245/*D#6*/,1319/*E6*/,1397/*F6*/,1480/*F#6*/,1568/*G6*/,1661/*G#6*/,1760/*A6*/,1865/*A#6*/,1976/*B6*/,
	//75--C7
    2093/*C7*/,2217/*C#7*/,2349/*D7*/,2489/*D#7*/,2637/*E7*/,2794/*F7*/,2960/*F#7*/,3136/*G7*/,3322/*G#7*/,3520/*A7*/,3729/*A#7*/,3951/*B7*/,
    //87
    4186/*C8*/
};

#define L_B 51	
#define N_B 63	
#define H_B 75	

//1-0
//2-2
//3-4
//4-5
//5-7
//6-9
//7-11
	
unsigned char ai_ruo_liu_li[] = {
	L_B+9,N_B+4,N_B+2,N_B+2,N_B+0,L_B+11,N_B+0,L_B+9,N_B+0,N_B+11,1000,        		//命4运4在4今4生4写4下6了2伏4笔80
	L_B+9,N_B+4,N_B+2,N_B+2,N_B+7,N_B+9,N_B+5+1,N_B+2,N_B+4,           				//梦4境4般4与4你4不4期8相4遇8
	N_B+4,N_B+7,N_B+9,N_B+7,N_B+2,N_B+7,N_B+4,N_B+0,L_B+9,        					//你2留2下12痣4在4眼4角8标4记8
	N_B+4,N_B+2,N_B+0,N_B+2,N_B+4,N_B+2,N_B+2,N_B+4,L_B+9,1000,1000,1000,    		//却2忘2记4前4世4的8约22定12 000
	L_B+9,N_B+4,N_B+2,N_B+2,N_B+0,L_B+11,N_B+0,L_B+9,N_B+0,L_B+11,1000,        		//注4定4了4结4局4看4不6穿2天4机8 0
	L_B+9,N_B+4,N_B+2,N_B+2,N_B+7,N_B+9,N_B+5+1,N_B+2,N_B+4,        				//我4们4始4终4难4逃4脱8宿4命8
	N_B+4,N_B+7,N_B+9,N_B+7,N_B+2,N_B+7,N_B+4,N_B+7,N_B+9,          				//隐2藏2在12面4具4下4的8表4情8
	N_B+4,N_B+2,N_B+0,N_B+2,N_B+4,N_B+2,N_B+7,N_B+9,N_B+9,           				//你2永2远4不4懂4的8悲4喜12
	N_B+9,N_B+11,H_B+0,H_B+2,H_B+0,N_B+11,N_B+9,N_B+7,N_B+4,N_B+2,N_B+4,N_B+9,     	//找2回2你4眼4中4失4去4颜4色4的4风4景6
	N_B+4,N_B+2,N_B+4,N_B+9,N_B+4,N_B+2,N_B+4,N_B+9,H_B+0,N_B+11,H_B+0,N_B+4,N_B+4,N_B+4,	//陪2你2看2尽6 繁2华2如2许6 花2落2荼24蘼88
	N_B+9,N_B+11,H_B+0,H_B+2,H_B+0,N_B+11,N_B+9,N_B+7,N_B+4,N_B+2,N_B+4,N_B+9,           	//解2开2你4心4底4所4有4尘4封4的4回4忆6
	N_B+4,N_B+2,N_B+4,N_B+9,N_B+4,N_B+2,N_B+4,N_B+9,H_B+0,N_B+11,H_B+0,N_B+9,N_B+9,       	//当2月2升2起6 忆2如2潮2汐6 如2梦2初24醒8
	N_B+4,N_B+2,N_B+4,N_B+9,N_B+4,N_B+2,N_B+4,N_B+9,H_B+4,H_B+2,H_B+4,N_B+9,N_B+9, 			//此2情2不2息6 生2死2不2渝12 爱2若2琉22璃4
};	

unsigned char music[]={  
	4,4,4,4,4,4,6,2,4,8,4,        		//命4运4在4今4生4写4下6了2伏4笔80
	4,4,4,4,4,4,8,4,8,           		//梦4境4般4与4你4不4期8相4遇8
	2,2,12,4,4,4,8,4,8,        			//你2留2下12痣4在4眼4角8标4记8
	2,2,4,4,4,8,2,2,12,4,4,4,     		//却2忘2记4前4世4的8约22定12 000
	4,4,4,4,4,4,6,2,4,8,4,        		//注4定4了4结4局4看4不6穿2天4机8 0
	4,4,4,4,4,4,8,4,8,        			//我4们4始4终4难4逃4脱8宿4命8
	2,2,12,4,4,4,8,4,8,          		//隐2藏2在12面4具4下4的8表4情8
	2,2,4,4,4,8,4,12,8,            		//你2永2远4不4懂4的8悲4喜12
	2,2,4,4,4,4,4,4,4,4,4,6,            //找2回2你4眼4中4失4去4颜4色4的4风4景6
	2,2,2,6,2,2,2,6,2,2,2,4,8,8,     	//陪2你2看2尽6 繁2华2如2许6 花2落2荼24蘼88
	2,2,4,4,4,4,4,4,4,4,4,6,         	//解2开2你4心4底4所4有4尘4封4的4回4忆6
	2,2,2,6,2,2,2,6,2,2,2,4,8,       	//当2月2升2起6 忆2如2潮2汐6 如2梦2初24醒8
	2,2,2,6,2,2,2,12,2,2,2,2,4, 		//此2情2不2息6 生2死2不2渝12 爱2若2琉22璃4       
};

unsigned char meter[] = {
      4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,        //想去远方的山川，想去海边看海鸥
      4,4,4,4,4,4,4,4,4,4,4,4,8,4,            //不管风雨有多少，有你就足够
      4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,        //喜欢看你的嘴角，喜欢看你的眉梢
      4,4,4,4,4,4,4,4,4,4,4,4,8,4,            //白云挂在那蓝天，像你的微笑
      4,4,2,2,4,4,4,4,4,4,2,2,4,4,8,4,        //你笑起来真好看，像春天的花一样！
      4,4,2,2,4,4,4,4,4,4,4,4,4,4,8,4,        //把所有的烦恼，所有的忧愁，统统都吹散
      4,4,2,2,4,4,4,4,4,4,4,4,4,8,4,          //你笑起来真好看，像夏天的阳光
      4,4,4,4,4,4,4,4,4,4,4,4,8,4,            //整个世界全部的时光，美得像画卷。
    };

void play_music(void)
{
		uint32_t i;
    uint32_t delay_time;

		for(i=0;i<sizeof(music)/sizeof(music[0]);i++){

    uint32_t tuneInterval = music[i] * 100; // 音符时间 100ms
		
		delay_time = 40 * 1000 * 1000/((uint32_t)pitch_names_frequency[ai_ruo_liu_li[i]]);
		
		if(ai_ruo_liu_li[i] != 0xE8)
		{
			TIM2->ARR = delay_time;		//设置分频系数
			TIM2->CCR2 = delay_time / 2;//设置TIM2-CH2PWM占空比为50%
			__HAL_TIM_ENABLE(&htim2);
			HAL_TIM_PWM_Start(&htim2,TIM_CHANNEL_2);	//开启PWM输出
			
			
			HAL_Delay(tuneInterval);
			
			HAL_GPIO_WritePin(GREEN_LED_GPIO_Port,GREEN_LED_Pin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(RED_LED_GPIO_Port,RED_LED_Pin,GPIO_PIN_RESET);
			HAL_TIM_PWM_Stop(&htim2,TIM_CHANNEL_2);

		}
		else
		{		
			HAL_Delay(tuneInterval);
		}        
			HAL_GPIO_WritePin(GREEN_LED_GPIO_Port,GREEN_LED_Pin,GPIO_PIN_RESET);
			HAL_GPIO_WritePin(RED_LED_GPIO_Port,RED_LED_Pin,GPIO_PIN_SET);

       HAL_Delay(100);
	}
		HAL_TIM_PWM_Stop(&htim2,TIM_CHANNEL_2);

}	
		