/*

*******************************************************************************
================================================================================
【平    台】stm32f103zet6_sumjess平台
【编    写】sumjess
【E-mail  】1371129880@qq.com
【软件版本】V2.0
【最后更新】2018年01月21日
【相关信息参考下列地址】
【网    站】http://www.openedv.com/
           http://www.stmcu.org/
					 http://www.firebbs.cn/forum.php
---------------------------------------------------------------------------------
【dev.env.】MDK5.14及以上版本
【Target  】stm32f103zet6
第一次修订：2017/11/09
第二次修订：2018/01/21
---------------------------------------------------------------------------------
没有完美的代码，只有不断的奉献，大家一起努力；
赠人玫瑰手留余香，欢迎大家反馈bug！
================================================================================
********************************************************************************



**************************************************
****************外部中断配置过程*******************
**************************************************

***************步骤****************

步骤①-⑤都在写在 EXTI_Init();里（包括EXTI_Init）。
步骤⑤-⑥为一部分。


①初始化IO口为输入。************在实验中为按键,这里的初始化实为8大模式***********
      GPIO_Init();
②开启IO口复用时钟。
      RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
③设置IO口与中断线的映射关系。@@@@在其对应的文件夹下有解释@@@@

      void GPIO_EXTILineConfig();为以下内容
    ************GPIO_EXTILineConfig(GPIO_PortSourceGPIOx,GPIO_PinSourcea);************
		
④初始化线上中断，设置触发条件等。
      EXTI_Init();为以下内容
			
	 ****************************GPIOx.a 中断线以及中断初始化配置**********************************注意下面的x和a
  	GPIO_EXTILineConfig(GPIO_PortSourceGPIOx,GPIO_PinSourcea);

  	EXTI_InitStruct.EXTI_Line=EXTI_Linea;
  	EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Interrupt;	**************选择中断请求 即 EXTI_Mode_Interrupt
  	EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Falling;//下降沿触发**********该位置需要通过实际使用来写******列如，按键按下电平变高则设置上升沿。
  	EXTI_InitStruct.EXTI_LineCmd = ENABLE;************开启
  	EXTI_Init(&EXTI_InitStruct);	 	//根据EXTI_InitStruct中指定的参数初始化外设EXTI寄存器
	  *********************************************************************************************	
			
⑤配置中断分组（NVIC），并使能中断。
      NVIC_Init();为以下内容
			
		***************************************************************************************************
		NVIC_InitStruct.NVIC_IRQChannel = EXTI0_IRQn;			//使能按键所在的外部中断通道********在stm32f10x.c第190行左右
  	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority =2;	//抢占优先级2 
  	NVIC_InitStruct.NVIC_IRQChannelSubPriority =1;					//子优先级1
  	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;								//使能外部中断通道
  	NVIC_Init(&NVIC_InitStruct);  	  //根据NVIC_InitStruct中指定的参数初始化外设NVIC寄存器
		****************************************************************************************************	
			
			
⑥编写中断服务函数。
      EXTIx_IRQHandler();
⑦清除中断标志位
      EXTI_ClearITPendingBit();

⑤-⑥格式为下

void EXTI0_IRQHandler(void)  ****在  startup_stm32f10x_hd.s  第80行左右*****
{
  delay_ms(10);    //消抖*************************
	if(WK_UP==1)					**************************
	{	  									**************************该部分内容根据需要编写即可
		LED0=!LED0;					**************************
		LED1=!LED1;					**************************
	}
	EXTI_ClearITPendingBit(EXTI_Line0);  //清除EXTI0线路挂起位
}

**************************************************************************************
***********************注意：程序中EXTI_LineX的X的匹配和对应****************************
**************************************************************************************
***********************注意：不要忘了在主函数中进行中断优先级分组************************
*********NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);// 设置中断优先级分组2*********
**************************************************************************************

**************简单的串口***************
#include "usart.h"

 int main(void)
 {	
 
	uart_init(9600);	 //串口初始化为9600
	
	while(1)
	{	    
		printf("OK\n");	  
  
	} 
}










*/



