/*

*******************************************************************************
================================================================================
【平    台】stm32f103zet6_sumjess平台
【编    写】sumjess
【E-mail  】1371129880@qq.com
【软件版本】V2.0
【最后更新】2018年01月21日
【相关信息参考下列地址】
【网    站】http://www.openedv.com/
           http://www.stmcu.org/
					 http://www.firebbs.cn/forum.php
---------------------------------------------------------------------------------
【dev.env.】MDK5.14及以上版本
【Target  】stm32f103zet6
第一次修订：2017/11/09
第二次修订：2018/01/21
---------------------------------------------------------------------------------
没有完美的代码，只有不断的奉献，大家一起努力；
赠人玫瑰手留余香，欢迎大家反馈bug！
================================================================================
********************************************************************************



usmart串口调试配置步骤


①将USMART包添加到工程中，头文件要包含到path。
②添加需要调用的函数到usmart_config.c文件中。
③主函数中调用usmart_dev.init函数初始化usmart。
④即可通过助手发送命令，调用在usmart注册过的函数







////////////////////////////////////////////////////////
******************************************************

void led_set(u8 sta)
{
	LED1=sta;
} 
//函数参数调用测试函数********************************usmart_config.c第42和43行取消注释
void test_fun(void(*ledset)(u8),u8 sta)
{
	ledset(sta);
}  
********************************************************
//////////////////////////////////////////////////////////
 
 
 
 
 
 int main(void)
 { 
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);// 设置中断优先级分组2
	delay_init();	    	 //延时函数初始化	
	uart_init(9600);	 	//串口初始化为9600&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&必写  
	LED_Init();				//初始化与LED连接的硬件接口
 	LCD_Init();				//初始化LCD
	usmart_dev.init(72); 	//初始化USMART	&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&必写
	POINT_COLOR=RED;
	LCD_ShowString(30,50,200,16,16,"Mini STM32 ^_^");	
	LCD_ShowString(30,70,200,16,16,"USMART TEST");	
	LCD_ShowString(30,90,200,16,16,"ATOM@ALIENTEK");
	LCD_ShowString(30,110,200,16,16,"2014/3/8");	   
  	while(1) 
	{		 	  
		LED0=!LED0;					 
		delay_ms(500);	
	}											    
}	









































*/



